Revit 2026 API

# RoutingPreferenceManager Class

---

Manages default pipe segments, fittings, and selection criteria for a given MEPCurveType

SystemObject Autodesk.Revit.DBRoutingPreferenceManager

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RoutingPreferenceManager : IDisposable
```
```vb
Public Class RoutingPreferenceManager
	Implements IDisposable
```
```cpp
public ref class RoutingPreferenceManager : IDisposable
```
```fsharp
type RoutingPreferenceManager =
    class
        interface IDisposable
    end
```

The RoutingPreferenceManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OwnerId | The Id of the MEPCurveType that owns the RoutingPreferenceManager |
|  | PreferredJunctionType | The preferred junction type. |

|  | Name | Description |
| --- | --- | --- |
|  | AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule) | Adds a new routing preference rule to the rule group. |
|  | AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule, Int32) | Adds a new routing preference rule to the specified position in the rule group. |
|  | Dispose | Releases all resources used by the RoutingPreferenceManager |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetMEPPartId | Gets a fitting or segment id of given routing preference group that meets the specified routing conditions. |
|  | GetNumberOfRules | The number of RoutingPreference rules in a group. |
|  | GetRule | Gets the specified rule. |
|  | GetSharedSizes | Gets a list of all segments of a given profile shape that define a given size. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | RemoveRule | Removes an existing routing preference rule. Thrown if the index is out of bounds. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

MEPCurveTypes contain a RoutingPreferenceManager property. The RoutingPreferenceManager contains rules for selecting segment types and sizes as well as fitting types based on user selection criteria.

#### Reference

Autodesk.Revit.DB Namespace